export enum ZhiEnum {
  子 = 1,
  丑 = 2,
  寅 = 3,
  卯 = 4,
  辰 = 5,
  巳 = 6,
  午 = 7,
  未 = 8,
  申 = 9,
  酉 = 10,
  戌 = 11,
  亥 = 12,
}

export enum GanEnum {
  甲 = 1,
  乙 = 2,
  丙 = 3,
  丁 = 4,
  戊 = 5,
  己 = 6,
  庚 = 7,
  辛 = 8,
  壬 = 9,
  癸 = 10
}

export enum NobleEnum {
    贵人 = 1,
    螣蛇 = 2,   
    朱雀 = 3,       
    六合 = 4,
    勾陈 = 5, 
    青龙 = 6,
    天空 = 7,
    白虎 = 8,
    太常 = 9,
    玄武 = 10,
    太阴 = 11,
    天后 = 12,
}

export enum NobleSlim {
    贵人 = "贵",
    螣蛇 = "蛇",   
    朱雀 = "朱",       
    六合 = "合",
    勾陈 = "勾", 
    青龙 = "龙",
    天空 = "空",
    白虎 = "虎",
    太常 = "常",
    玄武 = "玄",
    太阴 = "阴",
    天后 = "后",
}


export enum NobleXEnum {
    贵人 = 1,
    螣蛇 = 12,   
    朱雀 = 11,       
    六合 = 10,
    勾陈 = 9, 
    青龙 = 8,
    天空 = 7,
    白虎 = 6,
    太常 = 5,
    玄武 = 4,
    太阴 = 3,
    天后 = 2,
}

  /*
  
  十干寄宫歌诀：
  甲课寅兮乙课辰，丙戊课巳不须论，
  丁己课未庚申上，辛戌壬亥是其真，
  癸课原来丑宫坐，分明不用四正神。

  */

export enum QiGongEnum {
  甲 = "寅",
  乙 = "辰",
  丙 = "巳",
  丁 = "未",
  戊 = "巳",
  己 = "未",
  庚 = "申",
  辛 = "戌",
  壬 = "亥",
  癸 = "丑"
}

export const Xuns = [
        ['甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉'],
        ['甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未'],
        ['甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳'],
        ['甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯'],
        ['甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑'],
        ['甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥']
];

export enum RefEnum {
  Same = "兄",
  Suppress = "财",
  SuppressedBy = "官",
  Enhance = "孙",
  EnhancedBy = "父",
}

export enum SxEnum {
  子 = "鼠",
  丑 = "牛",
  寅 = "虎",
  卯 = "兔",
  辰 = "龙",
  巳 = "蛇",
  午 = "马",
  未 = "羊",
  申 = "猴",
  酉 = "鸡",
  戌 = "狗",
  亥 = "猪",
}

export enum TimeEnum {
  子 = "00:00",
  丑 = "02:00",
  寅 = "04:00",
  卯 = "06:00",
  辰 = "08:00",
  巳 = "10:00",
  午 = "12:00",
  未 = "14:00",
  申 = "16:00",
  酉 = "18:00",
  戌 = "20:00",
  亥 = "22:00",
}
